[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:28:45
                 }
                 
                 let m = k + 1;
-                while (m < cartas.length && cartas[m] === carta) {
+                while (m < cartas.length && true) {
 
                     faltam[j] = "erro";
killedBy: Should Run Baralho3 with test case CT4 and result in "[ 'erro', 13, 13, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "erro",
    13,
