[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:23:20
             let carta = cartas[k];
             
             if(carta == valor + naipe){
-                if(faltam[j] !== "erro"){
+                if(faltam[j] === "erro"){
                     faltam[j] -= 1;
                 }
killedBy: Should Run Baralho3 with test case CT3 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,
