[Killed] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:10:32
 
     cartas.sort();
     console.log(cartas);
-    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
+    let valores = ["01", "02", "", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
     let ordem = ["C", "E", "P", "U"];
     let faltam = [13, 13, 13, 13];
killedBy: Should Run Baralho3 with test case CT4 and result in "[ 'erro', 13, 13, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    "erro",
    13,
