[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:4:21
 module.exports.baralho3Correto = function baralho3Correto(entrada) {
     let cartas = [];
 
-    for (let i = 0; i < entrada.length; i += 3) {
+    for (let i = 0; i >= entrada.length; i += 3) {
         cartas.push(entrada.slice(i, i + 3))
     }
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
    13,

[Killed] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:9:92
     }
 
     cartas.sort();
-    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
+    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", ""];
     let ordem = ["C", "E", "P", "U"];
     let faltam = [13, 13, 13, 13];
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 0 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:9:44
     }
 
     cartas.sort();
-    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
+    let valores = ["01", "02", "03", "04", "", "06", "07", "08", "09", "10", "11", "12", "13"];
     let ordem = ["C", "E", "P", "U"];
     let faltam = [13, 13, 13, 13];
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 0 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] ArrayDeclaration
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:10:17
 
     cartas.sort();
     let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
-    let ordem = ["C", "E", "P", "U"];
+    let ordem = [];
     let faltam = [13, 13, 13, 13];
     let k = 0;
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
    13,

[Killed] ArrayDeclaration
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:11:18
     cartas.sort();
     let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
     let ordem = ["C", "E", "P", "U"];
-    let faltam = [13, 13, 13, 13];
+    let faltam = [];
     let k = 0;
 
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
-   13,

[Killed] BlockStatement
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:17:48
     for (let i = 0; i < valores.length; i++) {
         const valor = valores[i];
 
-        for (let j = 0; j < ordem.length; j++) {
-            const naipe = ordem[j];
-            let carta = cartas[k];
-
-            if(carta == valor + naipe){
-                if(faltam[j] !== "erro"){
-                    faltam[j] -= 1;
-                }
-                
-                let m = k + 1;
-                while (m < cartas.length && cartas[m] === carta) {
-
-                    faltam[j] = "erro";
-                    m++;
-                    k++;
-                    k = k % cartas.length;
-                }
-
-                k++;
-                k = k % cartas.length;
-            }
-
-        }
+        for (let j = 0; j < ordem.length; j++) {}
 
         
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
    13,

[Killed] ArithmeticOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:21:25
             const naipe = ordem[j];
             let carta = cartas[k];
 
-            if(carta == valor + naipe){
+            if(carta == valor - naipe){
                 if(faltam[j] !== "erro"){
                     faltam[j] -= 1;
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
    13,

[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:21:16
             const naipe = ordem[j];
             let carta = cartas[k];
 
-            if(carta == valor + naipe){
+            if(true){
                 if(faltam[j] !== "erro"){
                     faltam[j] -= 1;
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 4
+ Received  + 4

  Array [
-   11,
-   13,

[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:22:20
             let carta = cartas[k];
 
             if(carta == valor + naipe){
-                if(faltam[j] !== "erro"){
+                if(false){
                     faltam[j] -= 1;
                 }
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
    13,
