[Killed] BlockStatement
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:4:49
 module.exports.baralho3Correto = function baralho3Correto(entrada) {
     let cartas = [];
 
-    for (let i = 0; i < entrada.length; i += 3) {
-        cartas.push(entrada.slice(i, i + 3))
-    }
+    for (let i = 0; i < entrada.length; i += 3) {}
 
     cartas.sort();
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:4:21
 module.exports.baralho3Correto = function baralho3Correto(entrada) {
     let cartas = [];
 
-    for (let i = 0; i < entrada.length; i += 3) {
+    for (let i = 0; i <= entrada.length; i += 3) {
         cartas.push(entrada.slice(i, i + 3))
     }
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] ArithmeticOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:5:38
     let cartas = [];
 
     for (let i = 0; i < entrada.length; i += 3) {
-        cartas.push(entrada.slice(i, i + 3))
+        cartas.push(entrada.slice(i, i - 3))
     }
 
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] MethodExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:5:21
     let cartas = [];
 
     for (let i = 0; i < entrada.length; i += 3) {
-        cartas.push(entrada.slice(i, i + 3))
+        cartas.push(entrada)
     }
 
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Survived] MethodExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:8:5
         cartas.push(entrada.slice(i, i + 3))
     }
 
-    cartas.sort();
+    cartas;
     console.log(cartas);
     let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];

[Survived] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:10:26
 
     cartas.sort();
     console.log(cartas);
-    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
+    let valores = ["01", "", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
     let ordem = ["C", "E", "P", "U"];
     let faltam = [13, 13, 13, 13];

[Survived] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:10:86
 
     cartas.sort();
     console.log(cartas);
-    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
+    let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "", "13"];
     let ordem = ["C", "E", "P", "U"];
     let faltam = [13, 13, 13, 13];

[Survived] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:11:18
     cartas.sort();
     console.log(cartas);
     let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
-    let ordem = ["C", "E", "P", "U"];
+    let ordem = ["", "E", "P", "U"];
     let faltam = [13, 13, 13, 13];
     let k = 0;

[Survived] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:11:23
     cartas.sort();
     console.log(cartas);
     let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
-    let ordem = ["C", "E", "P", "U"];
+    let ordem = ["C", "", "P", "U"];
     let faltam = [13, 13, 13, 13];
     let k = 0;

[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:15:21
     let faltam = [13, 13, 13, 13];
     let k = 0;
 
-    for (let i = 0; i < valores.length; i++) {
+    for (let i = 0; false; i++) {
         const valor = valores[i];
 
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:15:21
     let faltam = [13, 13, 13, 13];
     let k = 0;
 
-    for (let i = 0; i < valores.length; i++) {
+    for (let i = 0; i >= valores.length; i++) {
         const valor = valores[i];
 
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:18:25
     for (let i = 0; i < valores.length; i++) {
         const valor = valores[i];
 
-        for (let j = 0; j < ordem.length; j++) {
+        for (let j = 0; false; j++) {
             const naipe = ordem[j];
             let carta = cartas[k];
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:18:25
     for (let i = 0; i < valores.length; i++) {
         const valor = valores[i];
 
-        for (let j = 0; j < ordem.length; j++) {
+        for (let j = 0; j >= ordem.length; j++) {
             const naipe = ordem[j];
             let carta = cartas[k];
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] BlockStatement
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:22:39
             const naipe = ordem[j];
             let carta = cartas[k];
             
-            if(carta == valor + naipe){
-                if(faltam[j] !== "erro"){
-                    faltam[j] -= 1;
-                }
-                
-                let m = k + 1;
-                while (m < cartas.length && cartas[m] === carta) {
-
-                    faltam[j] = "erro";
-                    m++;
-                    k++;
-                    k = k % cartas.length;
-                }
-
-                k++;
-                k = k % cartas.length;
-            }
+            if(carta == valor + naipe){}
 
         }
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:22:16
             const naipe = ordem[j];
             let carta = cartas[k];
             
-            if(carta == valor + naipe){
+            if(false){
                 if(faltam[j] !== "erro"){
                     faltam[j] -= 1;
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Survived] BlockStatement
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:23:41
             let carta = cartas[k];
             
             if(carta == valor + naipe){
-                if(faltam[j] !== "erro"){
-                    faltam[j] -= 1;
-                }
+                if(faltam[j] !== "erro"){}
                 
                 let m = k + 1;

[Survived] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:23:20
             let carta = cartas[k];
             
             if(carta == valor + naipe){
-                if(faltam[j] !== "erro"){
+                if(true){
                     faltam[j] -= 1;
                 }

[Survived] AssignmentOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:24:21
             
             if(carta == valor + naipe){
                 if(faltam[j] !== "erro"){
-                    faltam[j] -= 1;
+                    faltam[j] += 1;
                 }
                 

[Killed] ArithmeticOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:27:25
                     faltam[j] -= 1;
                 }
                 
-                let m = k + 1;
+                let m = k - 1;
                 while (m < cartas.length && cartas[m] === carta) {
 
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:28:45
                 }
                 
                 let m = k + 1;
-                while (m < cartas.length && cartas[m] === carta) {
+                while (m < cartas.length && cartas[m] !== carta) {
 
                     faltam[j] = "erro";
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] EqualityOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:28:24
                 }
                 
                 let m = k + 1;
-                while (m < cartas.length && cartas[m] === carta) {
+                while (m >= cartas.length && cartas[m] === carta) {
 
                     faltam[j] = "erro";
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Killed] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:30:33
                 let m = k + 1;
                 while (m < cartas.length && cartas[m] === carta) {
 
-                    faltam[j] = "erro";
+                    faltam[j] = "";
                     m++;
                     k++;
killedBy: Should Run Baralho3 with test case CT2 and result in "[ 13, 13, 13, 'erro' ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Array [
    13,
    13,

[Survived] UpdateOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:31:21
                 while (m < cartas.length && cartas[m] === carta) {
 
                     faltam[j] = "erro";
-                    m++;
+                    m--;
                     k++;
                     k = k % cartas.length;

[Survived] UpdateOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:32:21
 
                     faltam[j] = "erro";
                     m++;
-                    k++;
+                    k--;
                     k = k % cartas.length;
                 }

[Survived] ArithmeticOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:33:25
                     faltam[j] = "erro";
                     m++;
                     k++;
-                    k = k % cartas.length;
+                    k = k * cartas.length;
                 }
 

[Survived] UpdateOperator
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:36:17
                     k = k % cartas.length;
                 }
 
-                k++;
+                k--;
                 k = k % cartas.length;
             }

[Killed] ArrayDeclaration
Proj. Testes/ProjetoTestSoftware/Exercicio_Baralho/index.js:46:12
         
     }
 
-    return [faltam[0], faltam[1], faltam[3], faltam[2]];
+    return [];
 }
 
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 13, 13, 13, 13 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   13,
-   13,
