[Killed] StringLiteral
Proj. Testes/ProjetoTestSoftware/Exercicio_Mutantes_Baralho/index.js:11:33
     cartas.sort();
     console.log(cartas);
     let valores = ["01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13"];
-    let ordem = ["C", "E", "P", "U"];
+    let ordem = ["C", "E", "P", ""];
     let faltam = [13, 13, 13, 13];
     let k = 0;
killedBy: Should Run Baralho3 with test case CT1 and result in "[ 11, 13, 9, 12 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 3
+ Received  + 3

  Array [
-   11,
-   13,

[Killed] ConditionalExpression
Proj. Testes/ProjetoTestSoftware/Exercicio_Mutantes_Baralho/index.js:28:24
                 }
                 
                 let m = k + 1;
-                while (m < cartas.length && cartas[m] === carta) {
+                while (false) {
 
                     faltam[j] = "erro";
killedBy: Should Run Baralho3 with test case CT3 and result in "[ 4, 'erro', 12, 13 ]"
statusReason: Error: expect(received).toStrictEqual(expected) // deep equality

- Expected  - 2
+ Received  + 2

  Array [
-   4,
-   "erro",
